src/Catalogs/APDEX_УчетныеЗаписиЭлектроннойПочтыСервиса/APDEX_УчетныеЗаписиЭлектроннойПочтыСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>APDEX_УчетныеЗаписиЭлектроннойПочтыСервиса</name>
  <attributes>
    <name>SMTPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POP3Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортSMTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортPOP3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяSMTPАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжиданияСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьSSLSMTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьSSLPOP3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/APDEX_УчетныеЗаписиЭлектроннойПочтыСервиса/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПроверитьНастройки(Команда)
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	Профиль.АдресСервераPOP3 = Объект.POP3Сервер;
	Профиль.АдресСервераSMTP = Объект.SMTPСервер;
	Если Объект.ВремяОжиданияСервера > 0 Тогда
		Профиль.ВремяОжидания = Объект.ВремяОжиданияСервера;
	КонецЕсли; 
	Профиль.Пароль           = Объект.Пароль;
	Профиль.Пользователь     = Объект.Логин;
	Профиль.ПортPOP3         = Объект.ПортPOP3;
	Профиль.ПортSMTP         = Объект.ПортSMTP;
	
	Если Объект.ТребуетсяSMTPАутентификация Тогда
		Профиль.ПарольSMTP       = Объект.ПарольSMTP;
		Профиль.ПользовательSMTP = Объект.ЛогинSMTP;
	Иначе
		Профиль.ПарольSMTP       = Объект.Пароль;
		Профиль.ПользовательSMTP = Объект.Логин;
	КонецЕсли; 
	
	ИнтернетПочта = Новый ИнтернетПочта;
	
	Попытка
		ИнтернетПочта.Подключиться(Профиль);
	Исключение
		Сообщить(ОписаниеОшибки());
		Предупреждение("Произошли ошибки при проверке настроек учетной записи.
		|Описание ошибки приведено в окне сообщения.");
		Возврат;
		
	КонецПопытки;
	
	Предупреждение("Проверка подключения к почтовому серверу с заданными параметрами выполнена успешно.");
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() тогда
		Объект.ПортSMTP = 25;
		Объект.ПортPOP3 = 110;
		Объект.ВремяОжиданияСервера = 60;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
	Ответ =  Вопрос("Установить учетную запись в качестве системной для отправления писем?", РежимДиалогаВопрос.ДаНет); 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьСистемнуюЗаписьЭлектроннойПочты();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСистемнуюЗаписьЭлектроннойПочты()
	
	
	Настройки_АПДЕКС = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьНастройки();
	Настройки_АПДЕКС.APDEX_СистемнаяУчетнаяЗаписьПочтыСервиса = Объект.Ссылка;
	APDEX_ОценкаПроизводительностиСерверВызовСервера.УстановитьНастройки(Настройки_АПДЕКС);
	
	
КонецПроцедуры
